Model: "model_1"
__________________________________________________________________________________________________
 Layer (type)                Output Shape                 Param #   Connected to                  
==================================================================================================
 input_4 (InputLayer)        [(None, 80000, 6)]           0         []                            
                                                                                                  
 input_5 (InputLayer)        [(None, 80000)]              0         []                            
                                                                                                  
 input_6 (InputLayer)        [(None, 1)]                  0         []                            
                                                                                                  
 input_7 (InputLayer)        [(None, 1)]                  0         []                            
                                                                                                  
 model (Functional)          [(None, 1597, 500),          6176700   ['input_4[0][0]',             
                              (None, 80000),                         'input_5[0][0]',             
                              ()]                                    'input_6[0][0]']             
                                                                                                  
 add_loss (AddLoss)          ()                           0         ['model[0][2]']               
                                                                                                  
==================================================================================================
Total params: 6176700 (23.56 MB)
Trainable params: 6176700 (23.56 MB)
Non-trainable params: 0 (0.00 Byte)
__________________________________________________________________________________________________
